---
kind: property
id: P:Autodesk.Revit.DB.WallFoundation.WallId
source: html/01ace328-75ec-0fa9-d4a0-708136bbaaaa.htm
---
# Autodesk.Revit.DB.WallFoundation.WallId Property

Returns the id of the host wall.

## Syntax (C#)
```csharp
public ElementId WallId { get; }
```